# Задача 1 (26). Напишите программу, которая на вход принимает два числа A и B, и возводит число А в
# целую степень B с помощью рекурсии.
# Пример:
# A = 3; B = 5 -> 243 (3⁵)
# A = 2; B = 3 -> 8

# ------------ 1 вариант (костыль - W) --------------------
# def stepeni(x, y, w):
#     z = w
#     if y < 2:
#         return x
#     x *= z
#     y -= 1
#     return stepeni(x, y, w)
# A = int(input('Введите число А: '))
# B = int(input('Введите число B: '))
# print(f'A = {A}; B = {B} -> {stepeni(A, B, A)} ({A}**{B})')

# ------------ 2 вариант (быстро) --------------------
def stepeni(x, y):
    if y < 2:
        return x
    return x * stepeni(x, y-1)
A = int(input('Введите число А: '))
B = int(input('Введите число B: '))
print(f'A = {A}; B = {B} -> {stepeni(A, B)} ({A}**{B})')